[
  {
    "path": "posts/2021-02-19-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "LI Hongting",
        "url": "https://www.linkedin.com/in/lihongting/"
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1 Critiques and Suggestions1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2 Sketch of Proposed Design\r\n3 Steps to Create Dataviz Using Tableau3.1 Data preparation\r\n3.2 Main tab:\r\n3.3 Overview\r\n3.4 Demographics\r\n3.5 Bivariate correlation analysis\r\n3.6 Interaction among dashboards\r\n\r\n4 Discussion4.1 Insight 1: United Kindom has most respondents strongly agreed to vaccination while France is the one most against, 3 Asian countries has most proportion being neutral\r\n4.2 Insight 2: Distribution by gender and age group show a pattern\r\n4.3 Insight 3: Trust on government is positively correlated to willingness level, while side effect is on the opposite, and time helps.\r\n\r\n\r\nData Visualisation (Tableau Online): To vaccine or not vaccine: what is public view?\r\nData Source: Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub\r\n1 Critiques and Suggestions\r\nThe original data visualization intended to answer two questions, firstly, respondants from which country shows higher willingness for vaccination, and secondly, percentage of respondants agreed for vaccination. Below discussed clarity and aesthetics of the original DataViz.\r\n\r\n\r\n\r\nFigure 1: Critic original DataVi\r\n\r\n\r\n\r\n1.1 Clarity\r\n\r\n\r\nSN\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n1\r\n\r\n\r\nAuthor’s intention for left side chart is to answer question, which country has higher willingness level for vaccination. Bar chart is used for Likert data with 5 categories. It makes audiance difficult to interpret public view is towards agreement or disagreement.\r\n\r\n\r\nA normal bar chart can be used when there is two categories. For multi-category Liker data, diverging stacked bar chart is proposed.\r\n\r\n\r\n2\r\n\r\n\r\nRight side chart is better designed to answer the question posed by author.\r\n\r\n\r\nWe can follow the idea to present single view category. Proportion is with uncertainty, it varies with proportion and sample size. Hence, confidence interval is added and represent the graph with dot. Besides, to further enhance the chart with interactivity, all willingness level can be presented by selection and also included 4 common significance level for confidence interval.\r\n\r\n\r\n3\r\n\r\n\r\nLeft side chart is ordered aphabetically, reader need to eye ball to find out the trends. Right chart does well by soring and a good practice, which 1st chart is not in terms of sorting.\r\n\r\n\r\nTo improve from here, interactive features are proposed to allow readers to select which willingness level be used for sorting.\r\n\r\n\r\n1.2 Aesthetic\r\n\r\n\r\nSN\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n4\r\n\r\n\r\n5 completely different colors are used for bar chart. It is too colorful, and not helpful on grouping views on same or opposite side.\r\n\r\n\r\nWill use same color group for similar Likrt categories, e.g. dark and light blue for Strongly agree and Agree.\r\n\r\n\r\n5\r\n\r\n\r\nPosition of legend is located at the upper left color and leave a lot of white space.\r\n\r\n\r\nUse colored word as legend and position near the plot to avoid whitespace.\r\n\r\n\r\n6\r\n\r\n\r\nLegend title and content is not well elaborated, readers might think what is Vac 1 and the 5 confusing categories.\r\n\r\n\r\nLegend title will be avoided by using colored words. 5 categories will be elaborated with text.\r\n\r\n\r\n2 Sketch of Proposed Design\r\n\r\n\r\n\r\nFigure 2: Sketch of proposed design\r\n\r\n\r\n\r\nThis DataViz makeover is designed with emphasis on interactivity and 3 topics. 4 dashboard pages are proposed.\r\nMain page focused on a brief introduction on Covid-19, Covid-19 vaccination and aim of this dashboard.\r\nOverview page discussed about sample size, number of countries participated in this survey. Overall willingness distribution is presented with a donut chart, where as country level view is represented with a dot chart with confidence interval.\r\nDemographics page allows reader to select interested demographic factors and presented in diverging bar chart. There is some interactivity between the two diverging bar charts, that is to say, selecting one catecory of breakdown measure 1 will be filterred and updated in second chart. This allows reader to have two level of details deep dive analysis.\r\nAssociation page is a bi-variate correlation analysis for categorical data. Two variables are willingness level and a selected factor, such as, worry level of having vaccination, or concern on size effects. The matrix will be presented with a highlight table, i.e. color will be coded by number of counts by combination.\r\nOther than above mentioned interactivity. 4 visualizations are represented by 4 different icons. Selection of icon will navigate the user to corresponding visualization.\r\n3 Steps to Create Dataviz Using Tableau\r\n3.1 Data preparation\r\nFirst, inspect data in excel, raw data consists of 31 csv files for survey results. Checking a few data, I found out that some file does not have Vac_1 column, some file with this column but with empty value as well. Then I used Python for a simple data consolidation and filtering. Firstly, import relevant Python packages, change working directory to csv file location and consolidate all 31 files.\r\n\r\n\r\n\r\nFigure 3: Data cleanning with Python 1\r\n\r\n\r\n\r\nThen, investigate distinct value and counts for column vac_1, followed by selecting non-empty vac_1 entries and kept relevant columns for this DataViz study.\r\n\r\n\r\n\r\nFigure 4: Data cleanning with Python 2\r\n\r\n\r\n\r\nNext, save consolidated dataframe to csv file and proceed with Tableau.\r\n\r\n\r\n\r\nFigure 5: Data cleanning with Python 3\r\n\r\n\r\n\r\nStar off with Tableau, and drag over saved csv file to Connect to data page. Then, I go through all columns and codebook to identify areas to change.\r\nFirstly, I notice that countries do not start with capital letter. This is updated with Aliases function, by right clicking the upper left color triangle and choose Aliases. Then edit country name words to start with capital letter and repalce “-” with space.\r\n\r\n\r\n\r\nFigure 6: Update Country column with alias 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 7: Update Country column with alias 2\r\n\r\n\r\n\r\nNext is to change measures such as vac_1 to the question, by double clicking column names. Similarly I edit alias for vac_1 values to “Strongly agree”, “Agree”, “Neutral”, “Disagree” and “Strongly disagree”. Similary, I updated other fields started with vac.\r\n\r\n\r\n\r\n(#fig:vac1_colname)Rename vac1 as question content\r\n\r\n\r\n\r\nNext, I find that “Household Children” and “Household Size” are all digits, but they have different meaning, some might be number of children/people in the household, some digit represent the question is not answered. This two columns are auto-identified as “Measure Values”, so I drag them over to “Measure Names” on a new sheet side bar.\r\n\r\n\r\n\r\nFigure 8: Move data fields from Measure Values to Measure Names 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 9: Move data fields from Measure Values to Measure Names 2\r\n\r\n\r\n\r\nThen I updated aliases for “Household Size”. However, when I attempt to edit for “Household Children” as below, Tableau generates an Error Code, which specified output data type.\r\n\r\n\r\n\r\nFigure 10: Attempt to edit Aliases for Household Children\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 11: Error code for the attempt\r\n\r\n\r\n\r\nHence, a calculated field is used for recode “Household Children” by right click “Household Children” column name and choose “Create a Calculated Field..”. Besides, to simplify number of categories, values not specified in Codebook, e.g. 7, 8 and null are grouped as “Others”\r\n\r\n\r\n\r\nFigure 12: Create a calculated field to recode Household Children\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 13: Create a calculated field for\r\n\r\n\r\n\r\n3.2 Main tab:\r\nBelow is overview of main tab. There are 10 elements in total, I group them into 3 categories. a. Element 1: an “Image” object b. Element 2, 3, 5, 7, 9 and 10: “Text” object c. Element 4, 6, 8: “Sheet”\r\n\r\n\r\n\r\nFigure 14: Main page overview\r\n\r\n\r\n\r\n3.2.1 Creating “Image” object\r\nTo create an “Image” object, I created a Dashboard to begin with by clicking the tab with grid and + sign.\r\n\r\n\r\n\r\nFigure 15: Create a dashboard\r\n\r\n\r\n\r\nThen, I choose Dashobard size as “Generic Desktop (1366 x 768)” clicking the small triangles under “Size” pane.\r\n\r\n\r\n\r\nFigure 16: Choose dashboard size\r\n\r\n\r\n\r\nThen, I select “Image” icon under “Objects” pane, drag and drop to dashboard. An “Edit Image Object” window will pop up, then I choose an image from my local drive by clicking “Choose”. Options to “Fit Image” and “Center Image” are also checked.\r\n\r\n\r\n\r\nFigure 17: Adding an Image object to Dashboard 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 18: Adding an Image object to Dashboard 2\r\n\r\n\r\n\r\n3.2.2 Creating “Text” object\r\nSimilar to “Image” object, “Text” object can be found under “Objects” pane. After dragging and dropping, a text box window will top up. Then we can add texts with formatting color, font, size, bold etc.\r\nNote for element 10, the hyperlink is generated from excel and pasted to Tableau.\r\n3.2.3 Creating a “Sheet” for “Actions”, i.e. interactivity\r\nThough we see there is no much difference on element 1 and element 4. However, as mentioned in Section 2, I would like to add interactivity on element 4 for navigation. A straightforward image object does not allow “Actions”. Hence, a sheet is needed.\r\nTo start with, I create a calculated field to host the icon, named as “IconOverview” and valued at 0.\r\nThen, I create a new sheet, under “Marks” pane, choose “Shape” as mark by clicking the small triangle to expand the drop-down list.\r\n\r\n\r\n\r\nFigure 19: Create an image icon for interactivity\r\n\r\n\r\n\r\n3.2.4 Adding sheet to a dashboard\r\nSimilar to adding objects, sheets are added by dragging and dropping as well. All visible sheets can be found on “Sheets” pane, choose sheet of interest and move to desired position.\r\n\r\n\r\n\r\nFigure 20: Add Sheet to a dashboard\r\n\r\n\r\n\r\nLast but not least, we hover around and align the 10 elements. Also note that the navigation function is not enabled yet, as we need to create all four dashboards before adding actions.\r\n3.3 Overview\r\nBelow is overview of Overview tab. We can see there are 11 elements, similarly we group them as below.\r\na. Element 1: an “Image” object b. Element 2, 8, 11: “Text” object c. Element 3, 7: “Blank” object d. Element 4, 5, 6; “sheet” for navigation e. Element 9: a donut chart f. Element 10: circle chart with confidence interval plus 2 filters\r\nPoint a, b, d we have discussed in Section 3.2, I will focus on point c, e and f. \r\n\r\n\r\n\r\nFigure 21: Main page overview\r\n\r\n\r\n\r\n3.3.1 Creating a “Blank” object\r\nSimilar to “Text” and “Image” object, it can be found under “Objects” pane. Purpose of this object is to position other elements at a desired location or size. For example, in this case, without the two “Blank” objects. The 3 icons will be very large, and over-emphasized compared to other main contents. Two “Blank” objects can help to re-size icons and does not look like leave with too much white space.\r\n3.3.2 Creating a donut chart\r\nTo begin with, I created a calculated field, named as “Number of records” and valued at “1” to represent number of respondants.\r\nFor donut char itself, another calculated field is created, with name as “Zero” and formula as 0.\r\nThen move “Zero” to left side bar twice, and right click bottom Zero label and select “Dual Axis”.\r\n\r\n\r\n\r\nFigure 22: Creating a donut chart 1\r\n\r\n\r\n\r\nThen for first “SUM(Zero)”, change chart type as Pie, by right clicking small triangle under Marks pane for “SUM(Zero)”.\r\n\r\n\r\n\r\nFigure 23: Creating a donut chart 2\r\n\r\n\r\n\r\nAfter that, assessment item is selected for “Color”, “Number of records” is selected for “Size”. We\r\n\r\n\r\n\r\nFigure 24: Creating a donut chart 3\r\n\r\n\r\n\r\nFor the second “SUM(Zero)”, change chart type as Circle, and color same as background color, “white” in our case by editing “Color”, and also make the center white circle smaller with “Size” under Marks pane.\r\n\r\n\r\n\r\nFigure 25: Creating a donut chart 4\r\n\r\n\r\n\r\nNext, still at Marks pane for “SUM(Zero)(2)”, we drag over “Number of records” to be calculated by “SUM” and “Country” to be measured by “COUNT DISTINCT” to “Label” to display number of respondents and number of country participated in this survey. By clicking “Label” button, we alter text and also aligned text to shown in the center of circle.\r\n\r\n\r\n\r\nFigure 26: Creating a donut chart 5\r\n\r\n\r\n\r\nSimilarly, I checked “Show Labels” for pie chart to display the willingness distribution by views.\r\nThen, dual y-axis is removed by right clicking y-axis and unchecking “Show Header”.\r\n\r\n\r\n\r\nFigure 27: Creating a donut chart 6\r\n\r\n\r\n\r\nThen I added tooltip for the chart by choosing “Tooltip” under Marks pane, so when read hover around can have a quick understanding on what the segment is about.\r\n\r\n\r\n\r\nFigure 28: Creating a donut chart 7\r\n\r\n\r\n\r\nTooltip: > I <If a Covid-19 vaccine were made available to me this week, I would definitely get it:> to get a Covid-19 vaccine if available to me this week.\r\n% of respondants by views: <% of Total SUM(Number of records)> Number of respondents: <SUM(Number of records)> Number of participating countries: <CNTD(Country)>\r\n3.3.3 Creating a circle chart with confidence interval for proportion\r\nNow we discuss about how to create a circle chart with confidence interval for proportion. The chart also allows user to select which willingness level they want to visualize and significance level for the confidence interval.\r\nFirstly, create a parameter, “Significance level for CI” by right clicking a white space under “Parameters” pane.\r\n\r\n\r\n\r\nFigure 29: Creating a parameter for significance level 1\r\n\r\n\r\n\r\nKey in name, data type, current value, etc. as below.\r\n\r\n\r\n\r\nFigure 30: Creating a parameter for significance level 2\r\n\r\n\r\n\r\nSecond, list down all calculated fields, related to making such a chart.\r\n\r\nqnorm: IF [Significance level for CI]=0.99 THEN 2.3263 ELSEIF [Significance level for CI]=0.98 THEN 2.0537 ELSEIF [Significance level for CI] = 0.95 THEN 1.6449 elseif [Significance level for CI]= 0.9 THEN 1.2816 END\r\n\r\n\r\nTotal Response: {FIXED [Country]: COUNT([Index])}\r\n\r\n\r\nprop: COUNT([Consolidated_vac_1.csv])/sum([Total Response])\r\n\r\n\r\nProp_SE: SQRT({INCLUDE [If a Covid-19 vaccine were made available to me this week, I would definitely get it:]:[prop]*(1-[prop])}/ [Total Response])\r\n\r\n\r\nProp_margin of error: [qnorm]*[Prop_SE]\r\n\r\n\r\nProp_Lower Limit: {INCLUDE [If a Covid-19 vaccine were made available to me this week, I would definitely get it:]:[prop]}-[Prop_margin of error]\r\n\r\n\r\nProp_Upper Limit: {INCLUDE [If a Covid-19 vaccine were made available to me this week, I would definitely get it:]:[prop]}+[Prop_margin of error]\r\n\r\nNext, move ‘prop’ to “Columns” and “Country” to “Rows”, willingness question to “Details” under “Marks” pane and choose data type as “Circle”.\r\nThen also move willingness item to “Filters”, as we want to visualize the chart based on single views. A Filter window pops up, make select to “Select from list” and with “All” values.\r\n\r\n\r\n\r\nFigure 31: Adding filter\r\n\r\n\r\n\r\nThen, on the “Filters” pane, right click the measure, and choose “Show Filter”. The Filter will appear on the right of chart.\r\n\r\n\r\n\r\nFigure 32: Edit filter values\r\n\r\n\r\n\r\nClick the small triangle on the upper right corner of filter card, to “Edit Title” as “Views” as the original column name is very long. Also, change the display from “Multiple Values (list)” to “Single Value (dropdown)” and make “Strongly agree” as default setting.\r\n\r\n\r\n\r\nFigure 33: Edit filter title and display\r\n\r\n\r\n\r\nAfter this step, we can see the circle chart is sorted aphabetically. To help visualize which country has highest portion on a certain view, I chenged sorting style, by right click “Country” on “Columns” and select “Sorting”. In the pop up window, choose Sort By “Field” on Sort Order “Descending” with Field Name “prop”.\r\n\r\n\r\n\r\nFigure 34: Sorting by field values 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 35: Sorting by field values 2\r\n\r\n\r\n\r\nAssessment item is also added for Color, so color legend is aligned when with donut chart when different “View” selection is made.\r\nNext step is to add the confidence interval to the chart. We select “Prop_Lower Limit” and press “Ctrl” key on keyboard then select “Prop_Upper Limit”, drag and drop both measure to chart area.\r\n\r\n\r\n\r\nFigure 36: Adding lower limit and upper limit to chart 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 37: Adding lower limit and upper limit to chart 2\r\n\r\n\r\n\r\nThen a “Measure Values” containing value for “Prop_Lower Limit” and “Prop_Upper Limit” is created and added to “Rows”, move it to “Columns”, and a “Measure Values” containing “Prop_Lower Limit” and “Prop_Upper Limit” is added to “AGG(prop)” for size. Move “Measure Names” to “Columns” and change shape for “Measure Values” to “line”, move “Measure Names” in “Columns” as “Path” for “Measure Values”.\r\n\r\n\r\n\r\nFigure 38: Customize confidence interval elements in a chart 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 39: Customize confidence interval elements in a chart 2\r\n\r\n\r\n\r\nThen charts is displayed with circle chart on the left, and a horizontal line chart on the right. Right click x-axis of the right hand side chart, click “Dual Axis”, “Synchronize axis” and “Hide title”.\r\nNext, show “Significance level” parameter to allow users’ selection. Besides,since only one view be choosen at a time, color legend is not necessary and the card is removed by clicking the small triangle at the upper right corner and choose “Hide Card”.\r\n\r\n\r\n\r\nFigure 40: Remove color legend card\r\n\r\n\r\n\r\nLast step for this chart is to edit tooltip and chart title as below. “SUM(Number of records)” is added as Tooltip element for “AGG(prop)” so number of respondents by county and view can be included. Besides, since assessment item started with capital letter, a “Assessment text” calculated field is created to change the word to start with small letter.\r\nTooltip:\r\n\r\n<AGG(prop)> of respondants in  <If a Covid-19 vaccine were made available to me this week, I would definitely get it:> that they would like to take vaccination. :\r\n\r\nChart Title:\r\n\r\n% of respondants <ATTR(Assessment text)> to vaccination (<Parameters.Significance level for CI> confidence interval)\r\n\r\n3.3.4 Interaction within a dashboard\r\nFollow the step and concept discussed in section 3.2.1 and 3.2.4 to create a dashboard. Here, I would like to demonstrate how to add “Actions” so to interact within a dashboard.\r\nChoose “Dashboard” from top toolbar, select “Actions”.\r\n\r\n\r\n\r\nFigure 41: Adding action for interaction within in dashboard 1\r\n\r\n\r\n\r\nThen “Add Action” in the pop up window and choose “Filter”.\r\n\r\n\r\n\r\nFigure 42: Adding action for interaction within in dashboard 2\r\n\r\n\r\n\r\nThen edit filter action as below to allow selection so that when we selecting one segment in the donut chart, the confidence interval chart can be auto updated with selected view category. Deselecting will keep the filtered values, so that we will never see all view categories appeared tegother.\r\n\r\n\r\n\r\nFigure 43: Adding action for interaction within in dashboard 3\r\n\r\n\r\n\r\n3.4 Demographics\r\nBelow is overview of Demographics tab. We can see there are 12 elements, grouped as below.\r\na. Element 1: an “Image” object b. Element 2, 8, 12: “Text” object c. Element 3, 7: “Blank” object d. Element 4, 5, 6; “sheet” for navigation e. Element 9: sort selection function f. Element 10, 11: diverging stacked bar with a selector\r\nPoint a, b, c and d we have discussed in earlier sections, I will describe steps in details for point e and f. \r\n\r\n\r\n\r\nFigure 44: Main page overview\r\n\r\n\r\n\r\n3.4.1 diverging stacked bar\r\nFirst, adding parameter, “Select breakdown 1” for breakdown selector.\r\nAttributes to create this parameter is as below.\r\n\r\n\r\n\r\nFigure 45: Adding parameter to select demographics factor\r\n\r\n\r\n\r\nSecond, create below calculated fields relevant for breakdown selection and diverging stacked bar.\r\n\r\n[Select breakdown 1]:\r\nCASE [Select breakdown 1] WHEN “Country” THEN [Country1] WHEN “Gender” THEN [Gender] WHEN “Age Group” THEN [Age Group] WHEN “Employment Status” THEN [Employment Status] WHEN “Household Children” THEN [Household Children_recode] WHEN “Household Size” THEN STR([Household Size]) END\r\n\r\n\r\nTotal Count:\r\ntotal(sum([Number of records]))\r\n\r\n\r\nCount Negative:\r\nIF [If a Covid-19 vaccine were made available to me this week, I would definitely get it:]= ‘5 – Strongly disagree’ THEN 1 ELSEIF [If a Covid-19 vaccine were made available to me this week, I would definitely get it:] = ‘4’ THEN 1 ELSEIF [If a Covid-19 vaccine were made available to me this week, I would definitely get it:] = ‘3’ THEN 0.5 ELSE 0 END\r\n\r\n\r\nTotal Response:\r\n{FIXED [Country]: COUNT([Index])}\r\n\r\n\r\nTotal Count Negative:\r\nTOTAL(sum([Count Negative]))\r\n\r\n\r\nsum([Number of records])/[Total Count]\r\n\r\n\r\nGantt Start: -[Total Count Negative]/[Total Count]\r\n\r\n\r\nGantt Percent: PREVIOUS_VALUE([Gantt Start])+zn(LOOKUP([Percentage],-1))\r\n\r\nThen move “Gantt Percent” to “Columns”, “Selector 1” to “Rows”, assessment item for coloring, and “Percentage” as size. Change “Marks” type to “Gantt Bar”.\r\nChange ‘Gantt Percent’ aggregation to be by assessment item. It is achieved by right click “Gantt Percent” on “Columns” and choose “Compute Using” the assessment item.\r\n\r\n\r\n\r\nFigure 46: Create diverging stacked bar\r\n\r\n\r\n\r\nNext, we add 0 as reference line for better clearity. Go to “Analytics” panel, choose “Reference Line” under “Custom”, drop it in the chart area, and select Add a Reference Line “For Table”. Then change the value to be a constant at 0. We can also edit the line texture and color, so it is a supplementary portion to the chart.\r\n\r\n\r\n\r\nFigure 47: Add reference line for diverging stacked bar 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 48: Add reference line for diverging stacked bar 2\r\n\r\n\r\n\r\n3.4.2 Adding Sorting selection\r\nFirst, adding parameter, “Sort” for breakdown selector.\r\nAttributes to create this parameter is as below.\r\n\r\n\r\n\r\nFigure 49: Adding parameter to select which view to sort by\r\n\r\n\r\n\r\nSecond, create below calculated fields relevant for breakdown selection and diverging stacked bar.\r\nSort > IF [Parameters].[Sort] = 2 THEN [PrecentPositive] ELSEIF [Parameters].[Sort] = 1 THEN [PrecentPositiveStrong] ELSEIF [Parameters].[Sort] = 5 THEN [PrecentNegativeStrong] ELSEIF [Parameters].[Sort] = 4 THEN [PrecentNegative] ELSE [PrecentNeutral] END\r\nThen change sorting method for “Selector 1” to be sort by “Nested” “Descending” with field “Sort”.\r\nNext, we edit Tooltip and chart title for diverging stacked bar chart as below.\r\nTooltip: > Breakdown Selection 1: <Parameters.Select breakdown 1> - <Selector 1> Vaccinaiton acceptance:: <If a Covid-19 vaccine were made available to me this week, I would definitely get it:> Percentage :: <AGG(Percentage)>\r\nTitle: > Vaccination willingness level by <Parameters.Select breakdown 1>\r\nThen duplicate this sheet and selector elements (i.e. parameter “Select breakdown 1” and calculated field “Select breakdown 1”), update the sheet with “Select breakdown 2” so we can visualize two facotr at the same time.\r\n3.4.4 Interaction within a dashboard\r\nFollow the step and concept discussed in section 3.2.1 and 3.2.4 to create a dashboard. Remove redundant elements for visulization such as legend card as it is already coded in text object.\r\nThen add a filter action with attributes below to allow selection so that when we selecting one sub-category from one diverging stacked bar, the other chart will be updated.\r\n\r\n\r\n\r\nFigure 50: Adding action to filter between two diverging stacked bar\r\n\r\n\r\n\r\n3.5 Bivariate correlation analysis\r\nBelow is overview of Association tab. We can see there are 12 elements, grouped as below.\r\na. Element 1: an “Image” object b. Element 2, 11: “Text” object c. Element 3, 7: “Blank” object d. Element 4, 5, 6; “sheet” for navigation e. Element 8: selection filter f. Element 9+10: Highlight table\r\nPoint a, b, c, d, e we have discussed in earlier sections, I will touch on point f below.\r\n\r\n\r\n\r\nFigure 51: Association analysis page overview\r\n\r\n\r\n\r\n3.5.1 Highlight table to visualize association between two categorical variables\r\nFirst, we create a parameter, “Select a question” and also “Show Parameter” to allow audience to select another variable to compare with willingness level.\r\nAttributes to create this parameter is as below. Values are other survey questions.\r\n\r\n\r\n\r\nFigure 52: Adding parameter to select another question\r\n\r\n\r\n\r\nSecond, create below calculated fields relevant for breakdown selection and diverging stacked bar.\r\nSelector > CASE [Select a question] WHEN “I am worried about getting COVID19” THEN[I am worried about getting COVID19] WHEN “I am worried about potential side effects of a COVID19 vaccine” THEN[I am worried about potential side effects of a COVID19 vaccine] WHEN “I believe government health authorities in my country will provide me with an effective COVID19 vaccine” THEN [I believe government health authorities in my country will provide me with an effective COVID19 vaccine] WHEN “If I do not get a COVID19 vaccine when it is available, I will regret it” THEN [If I do not get a COVID19 vaccine when it is available, I will regret it] WHEN “If a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it” THEN [If a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it] END\r\nNext, choose assessment item as “Columns”, “Selector” as “Rows”, “Number of records” for “Text”, change chart type to “Highlight table” using “Show Me”\r\n\r\n\r\n\r\nFigure 53: Select chart type from Show Me\r\n\r\n\r\n\r\nSince we used orange color as main color throughout this dashboard design, we change color scale to be based off orange. Besides, we also edit Tooltip and title. Intention here is to show user which factor being compared with willingness level. Original question is two long in be included. We create a calculated field to summary what shorten the question to be a simple factor term.\r\nSelector_text: > CASE [Select a question] WHEN “I am worried about getting COVID19” THEN “Worry level” WHEN “I am worried about potential side effects of a COVID19 vaccine” THEN “Side effect” WHEN “I believe government health authorities in my country will provide me with an effective COVID19 vaccine” THEN “Trust on government” WHEN “If I do not get a COVID19 vaccine when it is available, I will regret it” THEN “Regretness” WHEN “If a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it” THEN “Time effect” END\r\nTooltip: > :  Willingness: <If a Covid-19 vaccine were made available to me this week, I would definitely get it:> Number of records: <SUM(Number of records)>\r\nTitle: > Willingness vs \r\n3.6 Interaction among dashboards\r\nNow we have completed all four dashboards. As mentioned earlier, we want to add “Actions” to the 4 icons so we can navigate by icon buttons.\r\nSimilar as filter action, a navigation action can be added by clicking “Action” under “Dashboard” on toolbar. In the pop up window, choose “Go to sheet” instead of “Filters”. Then, create action with below entry.\r\n\r\n\r\n\r\nFigure 54: Add action for navigation 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 55: Add action for navigation 2\r\n\r\n\r\n\r\nThis allows when “Select” “OverviewIcon” (the sheet name to represent the icon) will navigate user to target sheet “Overview”.\r\nDo it similarly for the rest of icons in dashboards.\r\n4 Discussion\r\n4.1 Insight 1: United Kindom has most respondents strongly agreed to vaccination while France is the one most against, 3 Asian countries has most proportion being neutral\r\nNavigate to “Overview” dashboard, when select view as “Strongly agree”, we can see that United Kindom has most respondents strongly agreed to vaccination. Followed by Israel and Denmark.\r\n\r\n\r\n\r\nFigure 56: United Kindom has most respondents strongly agreed to vaccination\r\n\r\n\r\n\r\nIn terms of strongly disagree, we can see that public in France has highest percentage against vaccination, leading by ~15% compared to that with second runner up, Germany.\r\n\r\n\r\n\r\nFigure 57: Public in France strongly against vaccination the most\r\n\r\n\r\n\r\nNavigate to “Demographics” dashboard, when we choose to breakdown by country and sort by “Neutral”, we can see that top 3 countries show neutral to vaccination are all Asian countries, namely South Korea, Singapore, Japan.We can also see the 3 countries has a very small bar on strong views, being it Strongly agree or Strongly disagree. This might be due to cultural difference.\r\n\r\n\r\n\r\nFigure 58: APublic in Asian countries shows most proportion with a neutral stand\r\n\r\n\r\n\r\n4.2 Insight 2: Distribution by gender and age group show a pattern\r\nStay on “Demographics” dashboard, when we breakdown by country and gender for two charts. On the left chart for breakdown by gender, can notice that male respondents are more willing to vaccination. Same trend can be seen, When we select different countries on the left. That is to say the trend, male respondents are more willing to vaccination compared to female, is observed at overview level as well as individual country level.\r\n\r\n\r\n\r\nFigure 59: Male is more pro-vaccine\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 60: Male is more pro-vaccine holds through different countries, example on Denmark\r\n\r\n\r\n\r\nStay on “Demographics” dashboard, when we breakdown by country and age group for two charts. It is observed that elderly are more willing to vaccination.\r\n\r\n\r\n\r\nFigure 61: Elderly are more towards vaccinations\r\n\r\n\r\n\r\n4.3 Insight 3: Trust on government is positively correlated to willingness level, while side effect is on the opposite, and time helps.\r\nNavigate to “Association analytics” dashboard, we can see that if public has a strong trust on government to bring them effective vaccine, tend to has more people agree to vaccination, so call positively related.\r\n\r\n\r\n\r\nFigure 62: Trust on government is positively related to willningness level\r\n\r\n\r\n\r\nSide effect matters, i.e. people worry about side effect of vaccine tend to against taking it. Worry level shows similar reverse co-occurrence pattern.\r\n\r\n\r\n\r\nFigure 63: Side effect matters\r\n\r\n\r\n\r\nTime helps, i.e. willingness level improved comparing vaccine now with one year later.\r\n\r\n\r\n\r\nFigure 64: Time helps improve willingness\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-19-dataviz-makeover-2/cri.png",
    "last_modified": "2021-02-19T23:00:43+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-23-dataviz-makeover1/",
    "title": "DataViz Makeover 1",
    "description": "This report is an assignment for course, ISSS608 Visual Analytics and Application.\nIt covers a critique and re-design for a graph from Singapore Labour Force, 2019 report. It also includes a step-by-step guide to create a dashboard in Tableau.",
    "author": [
      {
        "name": "LI Hongting",
        "url": "https://www.linkedin.com/in/lihongting/"
      }
    ],
    "date": "2021-01-23",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1 Critiques and Suggestions1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2 Sketch of Proposed Design\r\n3 Steps to Create Dataviz Using Tableau3.1 Data preparation\r\n3.2 Visualization 1: Resident Labour Share by Age Group, 2009 vs 2019\r\n3.3 Visualization 2: Working-aged Resident Share by Age Group, 2009 vs 2019\r\n3.4 Visualization 3: Resident LFPR by Age Group, 2009 vs 2019\r\n3.5 Dashboard creation\r\n\r\n4 Final Visualization\r\n5 Discussion5.1 Insight 1: Elderly resident labour force share increase\r\n5.2 Insight 2: Shifting to aging population\r\n5.3 Insight 3: LFPR increase across age groups\r\n5.4 Future works\r\n\r\n6 References\r\n\r\nData Visualisation (Tableau Online): Singapore Resident Labour Force, 2009 vs 2019\r\nData Source: Singapore MOM Labour Force 2019, Table 5 and Table 7\r\nOriginal dataviz:\r\n\r\n\r\n\r\nFigure 1: Original dataviz\r\n\r\n\r\n\r\n1 Critiques and Suggestions\r\n1.1 Clarity\r\n\r\n\r\nSN\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n1\r\n\r\n\r\nContents from the paragraph e.g. ‘share of residents aged 55 & over in the labour force rose substantially from 16% in 2009 to 25% in 2019’, is not simply presented in the graph, but need to aggregate data mannually.\r\n\r\n\r\nRe-organize age group as ‘15 to 24’, ‘25 to 54’ and ‘55 & over’.\r\n\r\n\r\n2\r\n\r\n\r\nThe graph and table cannot support some information in the summary paragraph, e.g. aging population, LFPR.\r\n\r\n\r\nAdd chart on working-aged residents distribution and LFPR.\r\n\r\n\r\n3\r\n\r\n\r\nThe chart does not convey message on median age of residents in the labour force.\r\n\r\n\r\nExclude this part from summary, as age group is categorical data, and data source is already aggregated by age group.\r\n\r\n\r\n1.2 Aesthetic\r\n\r\n\r\nSN\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n4\r\n\r\n\r\nGenerally, clear use of fonts, font sizes and colors. Colors are consitantly used by year.\r\n\r\n\r\nFollow and formart likewise.\r\n\r\n\r\n5\r\n\r\n\r\nThough median age is not well derived from same data source (as mentioned in SN/3), it is a good example to use annotation on the chart to highlight important information.\r\n\r\n\r\nFollow this practice to mark/annotate important information on chart.\r\n\r\n\r\n6\r\n\r\n\r\nUnits are not indicated in y-axis, which makes the chart difficult to read.\r\n\r\n\r\nEnsure proper axis use with title, headers, units and marks.\r\n\r\n\r\n2 Sketch of Proposed Design\r\n\r\n\r\n\r\nFigure 2: Sketch of proposed design\r\n\r\n\r\n\r\nLead-in paragraph is to highlight key information and insights from visualizations, which helps to guide readers on the key points.Figures mentioned in these paragraph will also be annotated in charts.\r\nLegend of year is explicitly displayed at top right corner, as this legend will be used throughout the dashboard.\r\nTo retain intent of original visualization and summary, a horizontal bar chart is used to compare Resident Labour Share by Age Group in 2009 versus what it was in 2019. This simplify the original chart with key information on resident labour force shares for 3 age groups.\r\nTo add a dumbbell chart to visualize the changes of Working-aged Resident Share by Age Group between 2009 and 2019. This is a variation of horizontal bar chart, where both years can be shown in same row, and easy to read the change in direction.\r\nTo add a circle plot to show LFPR (Labour Force Participation Rate) by age groups, which is mentioned in original paragraph.\r\n3 Steps to Create Dataviz Using Tableau\r\n3.1 Data preparation\r\nFirst, inspect data in excel, Table 7 includes resident labour force by 12 age sub-groups. Sheets, T7_F and T7_M are processed with following steps: (1) to remove excess rows at left and columns at right; (2) to add a new column ‘Gender’ followed by tab name.\r\n\r\n\r\n\r\nFigure 3: Re-organized Table 7\r\n\r\n\r\n\r\nSecond, prepare Table 5 Working-aged labour force data likewise. Since we will study age group with wider age bands, it is not simply calculated with sub age group LFPR, but by dividing total of resident labour force by working-aged resident per age group. As such, we use Table 7, resident labour force devided by LFPR from Table 5 to capture working-aged resident.\r\n\r\n\r\n\r\nFigure 4: Derive calculated table, working-aged resident population\r\n\r\n\r\n\r\nThird, import T7 data to Tableau Desktop by choosing File on the navigation bar and then connect to a Microsoft Excel file as below graph.\r\n\r\n\r\n\r\nFigure 5: Import data from excel file\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 6: Dragging over processed sheet to working area\r\n\r\n\r\n\r\nForth, Pivot 11 years as Year column, change Pivot Field Name as “Year”, and Pivot Field Measure as “Resident labour”. Change “Year” column data type to “Date” by clicking the small “abc” symbol at top left of a column.\r\n\r\n\r\n\r\nFigure 7: Pivot data from columns to rows\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 8: Change data type\r\n\r\n\r\n\r\nLast, create a calculated field named “Age group” by right clicking column “Age sub group”, choose “Create a calculated field” with below formula.\r\n\r\n\r\n\r\nFigure 9: Create a calculated field 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 10: Create a calculated field 2\r\n\r\n\r\n\r\nRepeat import and pivot likewise for the calculated table, “Resident population” sheet and join by “Year” with “T7_breakdown”. After pivoting 11 years, comprehend join selection by “Gender” and “Age sub group”.\r\n\r\n\r\n\r\nFigure 11: Join two sheets\r\n\r\n\r\n\r\n3.2 Visualization 1: Resident Labour Share by Age Group, 2009 vs 2019\r\nCreate a new sheet named as “% of Total Resident Labour by age group”. Select and drag “Age group”, “Year” columns to Rows, “Resident labour” to columns. Right click column attribute, select “Quick Table Calculation” by “Percent of Total”, and “Computing” with “Age group”.\r\n\r\n\r\n\r\nFigure 12: Add attributes and measures to chart and change calculation type\r\n\r\n\r\n\r\nThen, add “Year” to filter, select “Years” in the first pop out window and choose 2009, 2019 only as we want to compare this two timestamp.\r\n\r\n\r\n\r\nFigure 13: Add year to filter\r\n\r\n\r\n\r\nThen, “Year” is moved over to Color under Marks pane and select “blue” for 2019 and “light blue” for 2009.\r\n\r\n\r\n\r\nFigure 14: Add year to color\r\n\r\n\r\n\r\nAs mentioned in section 2, figures appeared in lead-in paragraph are marked/annotated in chart. It is achieved by right click particular chart dataviz object, e.g. bar chart and select “Mark Label” and then “Always Show” to add labels selectively.\r\n\r\n\r\n\r\nFigure 15: Add mark labels to the chart\r\n\r\n\r\n\r\nLast, hide “Year” from column labels as it is colored with legend, and edit sheet title as “Resident Labour Share by Age Group, 2009 vs 2019”, and tooltip as:\r\n\r\n<Age group> age group includes <% of Total SUM(Resident labour)> of total resident labours in <YEAR(Year)>.\r\n\r\n3.3 Visualization 2: Working-aged Resident Share by Age Group, 2009 vs 2019\r\nCreate a new sheet for working-aged resident share by age group. Select and drag “Age group” to Rows, “Resident” twice to columns as we want to create both the dot and line.\r\nThen, add “Year” to filter, select “Years” in the first pop out window and choose 2009, 2019 only as we want to compare this two timestamp.\r\nThen, “Year” is moved over to Color under Marks pane for first “Resident” column and choose object shape as “Circle”.\r\nUnder Marks pane for second “Resident” column, choose object shape as “Line”, drag over “Year” to “Path” and select path type as “Jump”.\r\n\r\n\r\n\r\nFigure 16: Change resident population as line chart\r\n\r\n\r\n\r\nRight click right side Resident chart axis and select “Dual Axis”. Then, hide axis at the top by right clicking x-axis at top and uncheck “Show header”.\r\n\r\n\r\n\r\nFigure 17: Use dual axis\r\n\r\n\r\n\r\nSwap sequence of two column to make the circle to appear behind the lines. Change both columns “Quick Table Calculation” type as “Percent of Total”, and “Computing” with “Age group”.\r\nLast, add marks for age group “55 & over”, edit x-axis as “% of Total Working-aged Resident”, sheet title as “Resident Labour Share by Age Group, 2009 vs 2019” and tooltip as:\r\n\r\n<Age group> age group includes <% of Total SUM(Resident)> of total working-age residents in <YEAR(Year)>.\r\n\r\n3.4 Visualization 3: Resident LFPR by Age Group, 2009 vs 2019\r\nCreate a new sheet named as “Labour Force Participation Rate” by age group. Create a calculated field, named “LFPR” with below formula:\r\n\r\n{EXCLUDE [Gender]: sum([Resident labour])/sum([Resident])}\r\n\r\nSelect and drag “LFPR” to Rows, “Age group” to columns, “Year” to both Color and Filters, with 2009 and 2019 selected.\r\nChange Shape as “Shape” with empty circles, which help reader to visualize the change by colors easily.\r\nNext, edit title with dynamic information:\r\n\r\nResident  by Age Group, 2009 vs 2019\r\n\r\nAlso, change tooltip as:\r\n\r\nLFPR for residents aged  is <SUM(LFPR)> in <YEAR(Year 1)>.\r\n\r\nLast, we want to highlight LFPR for age group “55 & over”, but mark label not appearing as percentage, so annotation is used instead by right clicking the object and select “Annotate” and then “Mark”.\r\n\r\n\r\n\r\nFigure 18: Label particular element with annotation\r\n\r\n\r\n\r\nwith below content:\r\n\r\n<SUM(Labour force participation rate)>\r\n\r\n3.5 Dashboard creation\r\nFirstly, create a dashboard and drag above 3 visualizations over.\r\nSecondly, under the Dashboard Pane, select and drag a text object to the top of the dashboard as title.In the pop out window, use font size, bold and color to highlight key information.\r\n\r\n\r\n\r\nFigure 19: Add text object to dashboard\r\n\r\n\r\n\r\nNext, similar to 2nd step, add another box as description paragraphs to discuss insights.In the pop out window, Use font size, bold and color to highlight key information.\r\nMoreover, from Dashboard pane, under Object, select and drag “Blank” over to the top right corner, to index the legend a bit lower than the title.\r\n\r\n\r\n\r\nFigure 20: Add blank object to dashboard\r\n\r\n\r\n\r\nNext, x axis title,“Age group” is shown at top of the chart in visualization 3, because it is categorical data, and axis header is at top of the chart, which is not conventional to position axis element/unit and header separately. (This is a limitation with Tableau currently.) So, we hide this by right clicking the title area and selecting field label for columns. This axis header is re-positioned at bottom of the chart by adding a floating text object. Select “Floating” at the bottom of Objects pane, then drag “Text” object over to the dashboard to create a floating text object.\r\n\r\n\r\n\r\nFigure 21: Add floating text object to dashboard\r\n\r\n\r\n\r\nLastly, add a text object at the bottom and include author, article and data source information. Hyperlink is pre-generated and pasted in excel and pasted over.\r\n4 Final Visualization\r\nBelow is the final visualization after this makeover journey.\r\n\r\n\r\n\r\nFigure 22: Final visualization\r\n\r\n\r\n\r\n5 Discussion\r\n5.1 Insight 1: Elderly resident labour force share increase\r\nLooking at the horizontal bar chart, we see that there are substantial increase from 16% in 2009 to 25% in 2019 for share of resident labour force aged 55 years old and above. While, for other 2 age groups, the share decreased from 2009 to 2019.\r\nThis dashboard highlighted that the share of resident aged 55 years old & over in the labour force rose substantially from 16% in 2009 to 25% in 2019. Meanwhile, the share of resident labour force aged 25 to 54, declined from 75% to 67%.\r\n5.2 Insight 2: Shifting to aging population\r\nFrom the dumbbell plot, we can see there is a aging population trend, whereas the share of residents aged 55 & over among working-aged resident population (aged 15 & over) rose from 25% in 2009 to 34% in 2019.\r\n5.3 Insight 3: LFPR increase across age groups\r\nFrom the circle chart, we can observe that LFPR increase across 3 age groups, with 55 years old and over being the most substantial one.\r\nEven though LFPR increase for the 15 to 24, and 25 to 54 age groups, the population cohorts moving into these age bands are smaller than those moving out as discussed in 5.2. As a result, resident labour force share descreased for the 2 age groups as mentioned in 5.1.\r\n5.4 Future works\r\nWe can also notice dataset include gender information, we might include this attribute to assess if there is any resident labour force population trend related to gender for future works.\r\n6 References\r\nHow to make dumbbell charts in Tableau\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-23-dataviz-makeover1/1original.png",
    "last_modified": "2021-01-28T15:03:23+08:00",
    "input_file": "dataviz-makeover1.utf8.md"
  },
  {
    "path": "posts/2021-01-17-my-tableau-collections/",
    "title": "My Tableau collections",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "LI Hongting",
        "url": "https://www.linkedin.com/in/lihongting/"
      }
    ],
    "date": "2021-01-17",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-17-my-tableau-collections/my-tableau-collections_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-17T19:39:34+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Hongting's Blog",
    "description": "Welcome to our new blog, Hongting's Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "LI Hongting",
        "url": "https://www.linkedin.com/in/lihongting/"
      }
    ],
    "date": "2021-01-17",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-17T16:34:16+08:00",
    "input_file": {}
  }
]
