[
  {
    "path": "posts/2021-01-23-dataviz-makeover1/",
    "title": "DataViz Makeover 1",
    "description": "This report is an assignment for course, ISSS608 Visual Analytics and Application.\nIt covers a critique and re-design for a graph from Singapore Labour Force, 2019 report. It also includes a step-by-step guide to create a dashboard in Tableau.",
    "author": [
      {
        "name": "LI Hongting",
        "url": "https://www.linkedin.com/in/lihongting/"
      }
    ],
    "date": "2021-01-23",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1 Critiques and Suggestions1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2 Sketch of Proposed Design\r\n3 Steps to Create Dataviz Using Tableau3.1 Data preparation\r\n3.2 Visualization 1: Resident Labour Share by Age Group, 2009 vs 2019\r\n3.3 Visualization 2: Working-aged Resident Share by Age Group, 2009 vs 2019\r\n3.4 Visualization 3: Resident LFPR by Age Group, 2009 vs 2019\r\n3.5 Dashboard creation\r\n\r\n4 Final Visualization\r\n5 Discussion5.1 Insight 1: Elderly resident labour force share increase\r\n5.2 Insight 2: Shifting to aging population\r\n5.3 Insight 3: LFPR increase across age groups\r\n5.4 Future works\r\n\r\n6 References\r\n\r\nData Visualisation (Tableau Online): Singapore Resident Labour Force, 2009 vs 2019\r\nData Source: Singapore MOM Labour Force 2019, Table 5 and Table 7\r\nOriginal dataviz:\r\n\r\n\r\n\r\nFigure 1: Original dataviz\r\n\r\n\r\n\r\n1 Critiques and Suggestions\r\n1.1 Clarity\r\n\r\n\r\nSN\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n1\r\n\r\n\r\nContents from the paragraph e.g. ‘share of residents aged 55 & over in the labour force rose substantially from 16% in 2009 to 25% in 2019’, is not simply presented in the graph, but need to aggregate data mannually.\r\n\r\n\r\nRe-organize age group as ‘15 to 24’, ‘25 to 54’ and ‘55 & over’.\r\n\r\n\r\n2\r\n\r\n\r\nThe graph and table cannot support some information in the summary paragraph, e.g. aging population, LFPR.\r\n\r\n\r\nAdd chart on working-aged residents distribution and LFPR.\r\n\r\n\r\n3\r\n\r\n\r\nThe chart does not convey message on median age of residents in the labour force.\r\n\r\n\r\nExclude this part from summary, as age group is categorical data, and data source is already aggregated by age group.\r\n\r\n\r\n1.2 Aesthetic\r\n\r\n\r\nSN\r\n\r\n\r\nCritiques\r\n\r\n\r\nSuggestions\r\n\r\n\r\n4\r\n\r\n\r\nGenerally, clear use of fonts, font sizes and colors. Colors are consitantly used by year.\r\n\r\n\r\nFollow and formart likewise.\r\n\r\n\r\n5\r\n\r\n\r\nThough median age is not well derived from same data source (as mentioned in SN/3), it is a good example to use annotation on the chart to highlight important information.\r\n\r\n\r\nFollow this practice to mark/annotate important information on chart.\r\n\r\n\r\n6\r\n\r\n\r\nUnits are not indicated in y-axis, which makes the chart difficult to read.\r\n\r\n\r\nEnsure proper axis use with title, headers, units and marks.\r\n\r\n\r\n2 Sketch of Proposed Design\r\n\r\n\r\n\r\nFigure 2: Sketch of proposed design\r\n\r\n\r\n\r\nLead-in paragraph is to highlight key information and insights from visualizations, which helps to guide readers on the key points.Figures mentioned in these paragraph will also be annotated in charts.\r\nLegend of year is explicitly displayed at top right corner, as this legend will be used throughout the dashboard.\r\nTo retain intent of original visualization and summary, a horizontal bar chart is used to compare Resident Labour Share by Age Group in 2009 versus what it was in 2019. This simplify the original chart with key information on resident labour force shares for 3 age groups.\r\nTo add a dumbbell chart to visualize the changes of Working-aged Resident Share by Age Group between 2009 and 2019. This is a variation of horizontal bar chart, where both years can be shown in same row, and easy to read the change in direction.\r\nTo add a circle plot to show LFPR (Labour Force Participation Rate) by age groups, which is mentioned in original paragraph.\r\n3 Steps to Create Dataviz Using Tableau\r\n3.1 Data preparation\r\nFirst, inspect data in excel, Table 7 includes resident labour force by 12 age sub-groups. Sheets, T7_F and T7_M are processed with following steps: (1) to remove excess rows at left and columns at right; (2) to add a new column ‘Gender’ followed by tab name.\r\n\r\n\r\n\r\nFigure 3: Re-organized Table 7\r\n\r\n\r\n\r\nSecond, prepare Table 5 Working-aged labour force data likewise. Since we will study age group with wider age bands, it is not simply calculated with sub age group LFPR, but by dividing total of resident labour force by working-aged resident per age group. As such, we use Table 7, resident labour force devided by LFPR from Table 5 to capture working-aged resident.\r\n\r\n\r\n\r\nFigure 4: Derive calculated table, working-aged resident population\r\n\r\n\r\n\r\nThird, import T7 data to Tableau Desktop by choosing File on the navigation bar and then connect to a Microsoft Excel file as below graph.\r\n\r\n\r\n\r\nFigure 5: Import data from excel file\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 6: Dragging over processed sheet to working area\r\n\r\n\r\n\r\nForth, Pivot 11 years as Year column, change Pivot Field Name as “Year”, and Pivot Field Measure as “Resident labour”. Change “Year” column data type to “Date” by clicking the small “abc” symbol at top left of a column.\r\n\r\n\r\n\r\nFigure 7: Pivot data from columns to rows\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 8: Change data type\r\n\r\n\r\n\r\nLast, create a calculated field named “Age group” by right clicking column “Age sub group”, choose “Create a calculated field” with below formula.\r\n\r\n\r\n\r\nFigure 9: Create a calculated field 1\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 10: Create a calculated field 2\r\n\r\n\r\n\r\nRepeat import and pivot likewise for the calculated table, “Resident population” sheet and join by “Year” with “T7_breakdown”. After pivoting 11 years, comprehend join selection by “Gender” and “Age sub group”.\r\n\r\n\r\n\r\nFigure 11: Join two sheets\r\n\r\n\r\n\r\n3.2 Visualization 1: Resident Labour Share by Age Group, 2009 vs 2019\r\nCreate a new sheet named as “% of Total Resident Labour by age group”. Select and drag “Age group”, “Year” columns to Rows, “Resident labour” to columns. Right click column attribute, select “Quick Table Calculation” by “Percent of Total”, and “Computing” with “Age group”.\r\n\r\n\r\n\r\nFigure 12: Add attributes and measures to chart and change calculation type\r\n\r\n\r\n\r\nThen, add “Year” to filter, select “Years” in the first pop out window and choose 2009, 2019 only as we want to compare this two timestamp.\r\n\r\n\r\n\r\nFigure 13: Add year to filter\r\n\r\n\r\n\r\nThen, “Year” is moved over to Color under Marks pane and select “blue” for 2019 and “light blue” for 2009.\r\n\r\n\r\n\r\nFigure 14: Add year to color\r\n\r\n\r\n\r\nAs mentioned in section 2, figures appeared in lead-in paragraph are marked/annotated in chart. It is achieved by right click particular chart dataviz object, e.g. bar chart and select “Mark Label” and then “Always Show” to add labels selectively.\r\n\r\n\r\n\r\nFigure 15: Add mark labels to the chart\r\n\r\n\r\n\r\nLast, hide “Year” from column labels as it is colored with legend, and edit sheet title as “Resident Labour Share by Age Group, 2009 vs 2019”, and tooltip as:\r\n\r\n<Age group> age group includes <% of Total SUM(Resident labour)> of total resident labours in <YEAR(Year)>.\r\n\r\n3.3 Visualization 2: Working-aged Resident Share by Age Group, 2009 vs 2019\r\nCreate a new sheet for working-aged resident share by age group. Select and drag “Age group” to Rows, “Resident” twice to columns as we want to create both the dot and line.\r\nThen, add “Year” to filter, select “Years” in the first pop out window and choose 2009, 2019 only as we want to compare this two timestamp.\r\nThen, “Year” is moved over to Color under Marks pane for first “Resident” column and choose object shape as “Circle”.\r\nUnder Marks pane for second “Resident” column, choose object shape as “Line”, drag over “Year” to “Path” and select path type as “Jump”.\r\n\r\n\r\n\r\nFigure 16: Change resident population as line chart\r\n\r\n\r\n\r\nRight click right side Resident chart axis and select “Dual Axis”. Then, hide axis at the top by right clicking x-axis at top and uncheck “Show header”.\r\n\r\n\r\n\r\nFigure 17: Use dual axis\r\n\r\n\r\n\r\nSwap sequence of two column to make the circle to appear behind the lines. Change both columns “Quick Table Calculation” type as “Percent of Total”, and “Computing” with “Age group”.\r\nLast, add marks for age group “55 & over”, edit x-axis as “% of Total Working-aged Resident”, sheet title as “Resident Labour Share by Age Group, 2009 vs 2019” and tooltip as:\r\n\r\n<Age group> age group includes <% of Total SUM(Resident)> of total working-age residents in <YEAR(Year)>.\r\n\r\n3.4 Visualization 3: Resident LFPR by Age Group, 2009 vs 2019\r\nCreate a new sheet named as “Labour Force Participation Rate” by age group. Create a calculated field, named “LFPR” with below formula:\r\n\r\n{EXCLUDE [Gender]: sum([Resident labour])/sum([Resident])}\r\n\r\nSelect and drag “LFPR” to Rows, “Age group” to columns, “Year” to both Color and Filters, with 2009 and 2019 selected.\r\nChange Shape as “Shape” with empty circles, which help reader to visualize the change by colors easily.\r\nNext, edit title with dynamic information:\r\n\r\nResident  by Age Group, 2009 vs 2019\r\n\r\nAlso, change tooltip as:\r\n\r\nLFPR for residents aged  is <SUM(LFPR)> in <YEAR(Year 1)>.\r\n\r\nLast, we want to highlight LFPR for age group “55 & over”, but mark label not appearing as percentage, so annotation is used instead by right clicking the object and select “Annotate” and then “Mark”.\r\n\r\n\r\n\r\nFigure 18: Label particular element with annotation\r\n\r\n\r\n\r\nwith below content:\r\n\r\n<SUM(Labour force participation rate)>\r\n\r\n3.5 Dashboard creation\r\nFirstly, create a dashboard and drag above 3 visualizations over.\r\nSecondly, under the Dashboard Pane, select and drag a text object to the top of the dashboard as title.In the pop out window, use font size, bold and color to highlight key information.\r\n\r\n\r\n\r\nFigure 19: Add text object to dashboard\r\n\r\n\r\n\r\nNext, similar to 2nd step, add another box as description paragraphs to discuss insights.In the pop out window, Use font size, bold and color to highlight key information.\r\nMoreover, from Dashboard pane, under Object, select and drag “Blank” over to the top right corner, to index the legend a bit lower than the title.\r\n\r\n\r\n\r\nFigure 20: Add blank object to dashboard\r\n\r\n\r\n\r\nNext, x axis title,“Age group” is shown at top of the chart in visualization 3, because it is categorical data, and axis header is at top of the chart, which is not conventional to position axis element/unit and header separately. (This is a limitation with Tableau currently.) So, we hide this by right clicking the title area and selecting field label for columns. This axis header is re-positioned at bottom of the chart by adding a floating text object. Select “Floating” at the bottom of Objects pane, then drag “Text” object over to the dashboard to create a floating text object.\r\n\r\n\r\n\r\nFigure 21: Add floating text object to dashboard\r\n\r\n\r\n\r\nLastly, add a text object at the bottom and include author, article and data source information. Hyperlink is pre-generated and pasted in excel and pasted over.\r\n4 Final Visualization\r\nBelow is the final visualization after this makeover journey.\r\n\r\n\r\n\r\nFigure 22: Final visualization\r\n\r\n\r\n\r\n5 Discussion\r\n5.1 Insight 1: Elderly resident labour force share increase\r\nLooking at the horizontal bar chart, we see that there are substantial increase from 16% in 2009 to 25% in 2019 for share of resident labour force aged 55 years old and above. While, for other 2 age groups, the share decreased from 2009 to 2019.\r\nThis dashboard highlighted that the share of resident aged 55 years old & over in the labour force rose substantially from 16% in 2009 to 25% in 2019. Meanwhile, the share of resident labour force aged 25 to 54, declined from 75% to 67%.\r\n5.2 Insight 2: Shifting to aging population\r\nFrom the dumbbell plot, we can see there is a aging population trend, whereas the share of residents aged 55 & over among working-aged resident population (aged 15 & over) rose from 25% in 2009 to 34% in 2019.\r\n5.3 Insight 3: LFPR increase across age groups\r\nFrom the circle chart, we can observe that LFPR increase across 3 age groups, with 55 years old and over being the most substantial one.\r\nEven though LFPR increase for the 15 to 24, and 25 to 54 age groups, the population cohorts moving into these age bands are smaller than those moving out as discussed in 5.2. As a result, resident labour force share descreased for the 2 age groups as mentioned in 5.1.\r\n5.4 Future works\r\nWe can also notice dataset include gender information, we might include this attribute to assess if there is any resident labour force population trend related to gender for future works.\r\n6 References\r\nHow to make dumbbell charts in Tableau\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-23-dataviz-makeover1/1original.png",
    "last_modified": "2021-01-28T15:03:23+08:00",
    "input_file": "dataviz-makeover1.utf8.md"
  },
  {
    "path": "posts/2021-01-17-my-tableau-collections/",
    "title": "My Tableau collections",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "LI Hongting",
        "url": "https://www.linkedin.com/in/lihongting/"
      }
    ],
    "date": "2021-01-17",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-17-my-tableau-collections/my-tableau-collections_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-17T19:39:34+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Hongting's Blog",
    "description": "Welcome to our new blog, Hongting's Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "LI Hongting",
        "url": "https://www.linkedin.com/in/lihongting/"
      }
    ],
    "date": "2021-01-17",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-17T16:34:16+08:00",
    "input_file": {}
  }
]
